Revit 2024 API
Material.Shininess Property
 The shininess of the material.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public int Shininess { get; set; }
Visual Basic
Public Property Shininess As Integer
	Get
	Set
Visual C++
public:
property int Shininess {
	int get ();
	void set (int value);
}
Field Value
 The value ranges from 0 to 128.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: values for shininess must be between 0 and 128
See Also
Material Class
Autodesk.Revit.DB Namespace